app/helpers/sessions_helper.rb

  def current_user
    @current_user ||= if session[:employee_id]
                        Employee.find_by(id: session[:employee_id])
                      elsif session[:admin_id]
                        Admin.find_by(id: session[:admin_id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]