app/controllers/employees_controller.rb

  def login
    employee = Employee.find_by(email: login_params[:email])
    admin = Admin.find_by(email: login_params[:email])
---
SELECT "employees".* FROM "employees" WHERE "employees"."email" = $1 LIMIT $2  [["email", "Dinesh1987@gmail.com"], ["LIMIT", 1]]
SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "Dinesh1987@gmail.com"], ["LIMIT", 1]]

  def signup
    @employee = Employee.new
    @admins = Admin.all
---
SELECT "admins".* FROM "admins"

  def create
    @employee = Employee.create!(employee_params)
---
INSERT INTO "employees" ("name", "email", "password_digest", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def admin_dashboard
    if logged_in? && current_user.is_a?(Admin)
      @employees = Employee.page(params[:page]).per(10)
---
SELECT "employees".* FROM "employees"

  def show
    @employee = Employee.find(params[:id])
    @monthly_attendance = @employee.monthly_attendance
    @yearly_attendance = @employee.yearly_attendance
    @total_hours = @employee.attendences.sum(:working_hours)
    @total_leaves = @employee.attendences.sum(:leaves)
    @total_days_attended = @employee.attendences.where(attended: true).count
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT SUM("attendences"."working_hours") FROM "attendences" WHERE "attendences"."employee_id" = $1  [["employee_id", 1]]
SELECT "attendences".* FROM "attendences" WHERE "attendences"."employee_id" = $1  [["employee_id", 1]]
SELECT COUNT(*) FROM "attendences" WHERE "attendences"."employee_id" = $1 AND "attendences"."attended" = $2  [["employee_id", 1], ["attended", true]]

  def correct_user
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]