app/models/attendence.rb

SELECT "employees".* FROM "employees" WHERE "employees"."email" = $1 LIMIT $2  [["email", "Dinesh1987@gmail.com"], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "attendences".* FROM "attendences" WHERE "attendences"."employee_id" = $1 AND "attendences"."date" = $2 LIMIT $3  [["employee_id", 1], ["date", "2024-07-29"], ["LIMIT", 1]]
---
  def self.process_attendance(json_data)
    data = JSON.parse(json_data)
    data.each do |record|
      employee = Employee.find_by(email: record['Email'])
      if employee
        attendance = employee.attendences.find_or_initialize_by(date: record['Date'])